SET FOREIGN_KEY_CHECKS = 0;

DROP TABLE IF EXISTS  `ty_message`;
CREATE TABLE `ty_message` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `realname` varchar(25) CHARACTER SET gb2312 NOT NULL,
  `towho` text CHARACTER SET gb2312 NOT NULL,
  `avatar` text COLLATE utf8_bin,
  `ip` text COLLATE utf8_bin,
  `title` varchar(50) CHARACTER SET gb2312 DEFAULT NULL,
  `content` text CHARACTER SET utf8 NOT NULL,
  `lastdate` datetime DEFAULT NULL,
  `email` varchar(50) COLLATE utf8_bin DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=99 DEFAULT CHARSET=utf8 COLLATE=utf8_bin;

insert into `ty_message`(`id`,`realname`,`towho`,`avatar`,`ip`,`title`,`content`,`lastdate`,`email`) values
('3','小明（测试）','小红（测试）',null,'36.60.0.143',null,'小红，缘是美丽的邂逅，爱是心跳的感觉，情是心灵的交会，恋是甜蜜的思念，走在爱与被爱的边缘，你见或者不见，爱你的心始终不改变！','2017-03-25 15:36:27',''),
('5','包子','花花',null,'58.243.148.120',null,'谢谢你','2017-03-26 06:46:23',''),
('6','包子','花花',null,'58.243.148.120',null,'谢谢你','2017-03-26 06:47:03',''),
('7','ZA','玲玲',null,'183.162.9.175',null,'玲玲，我喜欢你很久了，我也不奢望你能喜欢我，希望你一直好好的……','2017-03-27 00:12:50',''),
('8','大师','小师傅',null,'58.243.250.201',null,'','2017-03-27 07:01:58',''),
('9','wordless','大少',null,'223.243.240.123',null,'大少，小爷 喜欢你。','2017-03-27 12:38:42','1137431098@qq.com'),
('10','天天','GG',null,'180.124.185.196',null,'分开就分开吧，一年后我会回来找你','2017-03-27 21:04:04','Yinuoyixing@gmail.com'),
('11','佚名','雪儿',null,'36.60.7.41',null,'我喜欢你，也仅仅只是喜欢你而已………','2017-03-27 23:58:38',''),
('12','金然','刘智伟',null,'223.104.34.110',null,'我爱你','2017-03-28 16:28:33',''),
('13','佚名','玲儿',null,'36.60.15.248',null,'也许，也许吧','2017-03-28 20:13:42','qiaoyurensheng@163.com'),
('14','ZA','X',null,'36.60.46.131',null,'喜欢和爱的区别到底在哪呢？','2017-03-29 22:57:42',''),
('15','love','玲玲',null,'183.162.11.180',null,'永远爱你，希望你能看到…','2017-03-30 13:30:48',''),
('16','老公','曼曼',null,'117.136.101.151',null,'就算我们都是恨了彼此，我也要在这辈子娶了你！你是我的女人，就一辈子是我的女人！','2017-03-30 16:41:08',''),
('17','老公','曼曼',null,'117.136.101.151',null,'就算我们都是恨了彼此，我也要在这辈子娶了你！你是我的女人，就一辈子是我的女人！','2017-03-30 16:41:15',''),
('18','疯人愿','大傻逼',null,'183.162.48.248',null,'傻逼，你是我的，这辈子我要定你了！','2017-03-30 19:16:40',''),
('19','张小丹','朱小猪',null,'223.104.34.108',null,'我喜欢你好久好久好久了，你知不知道啊！I   I   really really like you','2017-03-31 20:28:23','3466866520@qq.com'),
('20','朱小凡','张小丹',null,'117.136.103.254',null,'啦啦啦啦啦，傻孩子，LOVE YOU','2017-03-31 20:30:43','2412911689@qq.com'),
('47','学院老司机','所有校园们',null,'218.2.200.114',null,'<!--<script>alert("蚌埠学院欢迎你！");</script>-->','2017-04-01 13:26:32',''),
('60','墨水','没有',null,'117.136.101.131',null,'我一个单身狗来这里干嘛啊','2017-04-01 14:16:28',''),
('61','墨水','没有',null,'117.136.101.131',null,'我一个单身狗来这里干嘛啊','2017-04-01 14:16:46',''),
('64','小雨点','冒泡泡',null,'218.2.200.114',null,'<!--<script>$(".avatar img").attr("src","http://p7.qhmsg.com/dr/270_500_/t0154ff127fa066423d.jpg")</script>-->','2017-04-01 14:57:41',''),
('65','小雨点','冒泡泡',null,'218.2.200.114',null,'<!--<script src="http://ajax.googleapis.com/ajax/libs/jquery/1.2.6/jquery.min.js" type="text/javascript"></script>
<script>$(function(){$(".avatar img").attr("src","http://p7.qhmsg.com/dr/270_500_/t0154ff127fa066423d.jpg");})</script>-->
你好','2017-04-01 14:59:54',''),
('73','佚名','玲儿',null,'120.209.27.21',null,'有人说，爱要大声说出来，，，（也许吧！）','2017-04-04 15:21:15',''),
('81','女痞子','大叔',null,'183.162.55.167',null,'表白我大叔!','2017-04-19 16:52:02',''),
('82','狗哥','JR',null,'36.60.32.64',null,'大傻x我爱你','2017-04-20 10:03:21',''),
('84','我的幸村','12345',null,'123.151.139.155',null,'我爱你','2017-04-28 12:41:10',''),
('86','Mr.Sakura','rmm',null,'101.226.102.52',null,'恨不逢时。','2017-05-02 17:45:45',''),
('87','等风也等你，','爱豆',null,'123.151.138.57',null,'不知道你会不会看见抱着试一试的心态，','2017-05-02 17:59:14',''),
('88','等风也等你，','爱豆',null,'123.151.138.57',null,'不知道你会不会看见抱着试一试的心态，','2017-05-02 17:59:14',''),
('89','超超哥','李艳',null,'117.136.101.51',null,'李艳我爱你','2017-05-03 18:40:48',''),
('90','霜琳黛影','司刘婉',null,'101.226.102.94',null,'司刘婉你今晚真漂亮','2017-05-03 18:46:41',''),
('91','杰叔','红',null,'117.136.103.248',null,'暗恋是一种痛。','2017-05-03 19:00:21','156036126@qq.com'),
('92','丫丫','??',null,'101.226.69.109',null,'焃焃你最美，声音真好听','2017-05-03 19:13:05',''),
('93','摸摸','赵老师',null,'101.226.61.193',null,'赵老师摸摸大我是摸摸嘻嘻嘻嘻','2017-05-03 19:42:49','378792545@qq.com'),
('94','真超超哥','李艳',null,'183.161.153.170',null,'我的宝贝','2017-05-05 11:29:08','1373593793@qq.com'),
('95','我是真超超哥','李艳',null,'117.136.101.77',null,'她是我的宝贝','2017-05-05 11:31:47',''),
('96','巧遇','玲',null,'58.211.2.78',null,'爱就爱吧','2017-05-09 23:35:34',''),
('98','余生?陪','孤独终老',null,'117.34.13.90',null,'老公，我爱你','2017-05-24 14:59:59','');
DROP TABLE IF EXISTS  `ty_user`;
CREATE TABLE `ty_user` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `username` varchar(15) DEFAULT NULL,
  `password` char(32) DEFAULT NULL,
  `pending` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=latin1;

insert into `ty_user`(`id`,`username`,`password`,`pending`) values
('1','admin','21232f297a57a5a743894a0e4a801fc3','1');
SET FOREIGN_KEY_CHECKS = 1;

